MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC123SD4AE0/mcu.h
#define FMC_ISPCON_ISPEN_Pos                    0                                       /*!< FMC_T::ISPCON: ISPEN Position */
#define FMC_ISPCON_ISPEN_Msk                    (1ul << FMC_ISPCON_ISPEN_Pos)           /*!< FMC_T::ISPCON: ISPEN Mask */

/* FMC ISPADR Bit Field Definitions */
#define FMC_ISPADR_ISPADR_Pos                   0                                       /*!< FMC_T::ISPADR: ISPADR Position */
#define FMC_ISPADR_ISPADR_Msk                   (0xFFFFFFFFul << FMC_ISPADR_ISPADR_Pos) /*!< FMC_T::ISPADR: ISPADR Mask     */

/* FMC ISPADR Bit Field Definitions */
#define FMC_ISPDAT_ISPDAT_Pos                   0                                       /*!< FMC_T::ISPDAT: ISPDAT Position */
#define FMC_ISPDAT_ISPDAT_Msk                   (0xFFFFFFFFul << FMC_ISPDAT_ISPDAT_Pos) /*!< FMC_T::ISPDAT: ISPDAT Mask     */

/* FMC ISPCMD Bit Field Definitions */
#define FMC_ISPCMD_FOEN_Pos                     5                                       /*!< FMC_T::ISPCMD: FOEN Position */
#define FMC_ISPCMD_FOEN_Msk                     (1ul << FMC_ISPCMD_FOEN_Pos)            /*!< FMC_T::ISPCMD: FOEN Mask */

#define FMC_ISPCMD_FCEN_Pos                     4                                       /*!< FMC_T::ISPCMD: FCEN Position */
#define FMC_ISPCMD_FCEN_Msk                     (1ul << FMC_ISPCMD_FCEN_Pos)            /*!< FMC_T::ISPCMD: FCEN Mask */

#define FMC_ISPCMD_FCTRL_Pos                    0                                       /*!< FMC_T::ISPCMD: FCTRL Position */
#define FMC_ISPCMD_FCTRL_Msk                    (0xFul << FMC_ISPCMD_FCTRL_Pos)         /*!< FMC_T::ISPCMD: FCTRL Mask */

/* FMC ISPTRG Bit Field Definitions */
#define FMC_ISPTRG_ISPGO_Pos                    0                                       /*!< FMC_T::ISPTRG: ISPGO Position */
#define FMC_ISPTRG_ISPGO_Msk                    (1ul << FMC_ISPTRG_ISPGO_Pos)           /*!< FMC_T::ISPTRG: ISPGO Mask */

/* FMC DFBADR Bit Field Definitions */
#define FMC_DFBADR_DFBA_Pos                     0                                       /*!< FMC_T::DFBADR: DFBA Position */
#define FMC_DFBADR_DFBA_Msk                     (0xFFFFFFFFul << FMC_DFBADR_DFBA_Pos)   /*!< FMC_T::DFBADR: DFBA Mask     */

/* FMC FATCON Bit Field Definitions */
#define FMC_FATCON_FOMSEL1_Pos                  6                                       /*!< FMC_T::FATCON: FOMSEL1 Position */
#define FMC_FATCON_FOMSEL1_Msk                  (1ul << FMC_FATCON_FOMSEL1_Pos)         /*!< FMC_T::FATCON: FOMSEL1 Mask */

#define FMC_FATCON_FOMSEL0_Pos                  4                                       /*!< FMC_T::FATCON: FOMSEL0 Position */
#define FMC_FATCON_FOMSEL0_Msk                  (1ul << FMC_FATCON_FOMSEL0_Pos)         /*!< FMC_T::FATCON: FOMSEL0 Mask */

#define FMC_FATCON_FATS_Pos                     1                                       /*!< FMC_T::FATCON: FATS Position */
#define FMC_FATCON_FATS_Msk                     (7ul << FMC_FATCON_FATS_Pos)            /*!< FMC_T::FATCON: FATS Mask */

#define FMC_FATCON_FPSEN_Pos                    0                                       /*!< FMC_T::FATCON: FPSEN Position */
#define FMC_FATCON_FPSEN_Msk                    (1ul << FMC_FATCON_FPSEN_Pos)           /*!< FMC_T::FATCON: FPSEN Mask */


#define FMC_ISPSTA_ISPGO_Pos                    0                                       /*!< FMC_T::ISPSTA: ISPGO Position */
#define FMC_ISPSTA_ISPGO_Msk                    (1ul << FMC_ISPSTA_ISPGO_Pos)           /*!< FMC_T::ISPSTA: ISPGO Mask */

#define FMC_ISPSTA_CBS_Pos                      1                                       /*!< FMC_T::ISPSTA: CBS Position */
#define FMC_ISPSTA_CBS_Msk                      (0x3ul << FMC_ISPSTA_CBS_Pos)           /*!< FMC_T::ISPSTA: CBS Mask */

#define FMC_ISPSTA_ISPFF_Pos                    6                                       /*!< FMC_T::ISPSTA: ISPFF Position */
#define FMC_ISPSTA_ISPFF_Msk                    (0x3ul << FMC_ISPSTA_ISPFF_Pos)         /*!< FMC_T::ISPSTA: ISPFF Mask */

#define FMC_ISPSTA_VECMAP_Pos                   9                                       /*!< FMC_T::ISPSTA: VECMAP Position */
#define FMC_ISPSTA_VECMAP_Msk                   (0xFFFul << FMC_ISPSTA_VECMAP_Pos)      /*!< FMC_T::ISPSTA: VECMAP Mask */

/*@}*/ /* end of group REG_FMC_BITMASK */
/*@}*/ /* end of group REG_FMC */



/*--------------------- General Purpose I/O (GPIO) ---------------------*/
/** @addtogroup REG_GPIO General Purpose Input/Output Controller (GPIO)
  Memory Mapped Structure for General Purpose I/O
  @{
 */

typedef struct
{


/**
 * @var GPIO_T::PMD
 * Offset: 0x00/0x40/0x80/0xC0/0x140  GPIO Port [A/B/C/D/F] Pin I/O Mode Control
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2n+1:2n]|PMDn     |GPIOx I/O Pin[n] Mode Control
 * |        |          |Determine each I/O mode of GPIOx pins.
 * |        |          |00 = GPIO port [n] pin is in Input mode.
 * |        |          |01 = GPIO port [n] pin is in Push-pull Output mode.
 * |        |          |10 = GPIO port [n] pin is in Open-drain Output mode.
 * |        |          |11 = GPIO port [n] pin is in Quasi-bidirectional mode.
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::OFFD
 * Offset: 0x04/0x44/0x84/0xC4/0x144  GPIO Port [A/B/C/D/F] Pin Digital Input Path Disable Control
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[[n+16]]|OFFDn     |GPIOx Pin[n] Digital Input Path Disable Control
 * |        |          |Each of these bits is used to control if the digital input path of corresponding GPIO pin is disabled.
 * |        |          |If input is analog signal, users can disable GPIO digital input path to avoid current leakage.
 * |        |          |0 = I/O digital input path Enabled.
 * |        |          |1 = I/O digital input path Disabled (digital input tied to low).
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::DOUT
 * Offset: 0x08/0x48/0x88/0xC8/0x148  GPIO Port [A/B/C/D/F] Data Output Value
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[n]     |DOUTn     |GPIOx Pin[n] Output Value
 * |        |          |Each of these bits controls the status of a Px.n pin when the Px.n is configured as Push-pull output, Open-drain output or Quasi-bidirectional mode.
 * |        |          |0 = Px.n will drive Low if the Px.n pin is configured as Push-pull output, Open-drain output or Quasi-bidirectional mode.
 * |        |          |1 = Px.n will drive High if the Px.n pin is configured as Push-pull output or Quasi-bidirectional mode.     
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::DMASK
 * Offset: 0x0C/0x4C/0x8C/0xCC/0x14C  GPIO Port [A/B/C/D/F] Data Output Write Mask
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[n]     |DMASKn    |GPIOx Pin[n] Data Output Write Mask     
 * |        |          |These bits are used to protect the corresponding DOUT (GPIOx_DOUT[n]) bit. 
 * |        |          |When the DATMSK (GPIOx _DATMSK[n]) bit is set to 1, the corresponding DOUT (GPIOx _DOUT[n]) bit is protected. 
 * |        |          |If the write signal is masked, writing data to the protect bit is ignored.        
 * |        |          |0 = Corresponding DOUT (GPIOx_DOUT[n]) bit can be up2025-06-12d.
 * |        |          |1 = Corresponding DOUT (GPIOx_DOUT[n]) bit protected.
 * |        |          |Note1: This function only protect corresponding DOUT (GPIOx_DOUT[n]) bit, and will not protect corresponding bit control register GPIOxn_DOUT.
 * |        |          |Note2:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::PIN
 * Offset: 0x10/0x50/0x90/0xD0/0x150  GPIO Port [A/B/C/D/F] Pin Value
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[n]     |PINn      |GPIOx Pin[n] Pin Values
 * |        |          |Each bit of the register reflects the actual status of the respective GPIO pin.
 * |        |          |If the bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::DBEN
 * Offset: 0x14/0x54/0x94/0xD4/0x154  GPIO Port [A/B/C/D/F] De-bounce Enable
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[n]     |DBENn     |GPIOx Pin[n] Input Signal De-Bounce Enable
 * |        |          |The DBEN[n] bit is used to enable the de-bounce function for each corresponding bit. 
 * |        |          |If the input signal pulse width cannot be sampled by continuous two de-bounce sample cycle, the input signal transition is seen as the signal bounce and will not trigger the interrupt. 
 * |        |          |The de-bounce clock source is controlled by DBCLKSRC (DBNCECON [4]), one de-bounce sample cycle period is controlled by DBCLKSEL (DBNCECON [3:0]).
 * |        |          |0 = Px.n de-bounce function Disabled.
 * |        |          |1 = Px.n de-bounce function Enabled.
 * |        |          |The de-bounce function is valid only for edge triggered interrupt. If the interrupt mode is level triggered, the de-bounce enable bit is ignored.     
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::IMD
 * Offset: 0x18/0x58/0x98/0xD8/0x158  GPIO Port [A/B/C/D/F] Interrupt Mode Control
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[n]     |IMDn      |GPIOx Pin[n] Edge Or Level Detection Interrupt Control
 * |        |          |IMD[n] is used to control the interrupt is by level trigger or by edge trigger.
 * |        |          |If the interrupt is by edge trigger, the trigger source can be controlled by de-bounce.
 * |        |          |If the interrupt is by level trigger, the input source is sampled by one HCLK clock and generates the interrupt.
 * |        |          |0 = Edge trigger interrupt.
 * |        |          |1 = Level trigger interrupt.
 * |        |          |If the pin is set as the level trigger interrupt, only one level can be set on the registers GPIOx_IEN.
 * |        |          |If both levels to trigger interrupt are set, the setting is ignored and no interrupt will occur.
 * |        |          |The de-bounce function is valid only for edge triggered interrupt. If the interrupt mode is level triggered, the de-bounce enable bit is ignored.
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::IEN
 * Offset: 0x1C/0x5C/0x9C/0xDC/0x15C  GPIO Port [A/B/C/D/F] Interrupt Enable
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[n]     |IF_ENn    |GPIOx Pin[n] Falling Edge or Low Level Interrupt Trigger Type Enable Bit
 * |        |          |The IF_EN (GPIOx_IEN[n]) bit is used to enable the interrupt for each of the corresponding input Px.n pin. Set bit to 1 also enable the pin wake-up function.
 * |        |          |When setting the IF_EN (Px_IEN[n]) bit to 1 :
 * |        |          |If the interrupt is level trigger (IMD (GPIOx_IMD[n]) bit is set to 1), the input Px.n pin will generate the interrupt while this pin state is at low level.
 * |        |          |If the interrupt is edge trigger(IMD (GPIOx_IMD[n]) bit is set to 0), the input Px.n pin will generate the interrupt while this pin state changed from high to low.
 * |        |          |0 = Px.n level low or high to low interrupt Disabled.
 * |        |          |1 = Px.n level low or high to low interrupt Enabled.  
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.     
 * |[n+16]  |IR_ENn    |GPIOx Pin[n] Rising Edge or High Level Interrupt Trigger Type Enable Bit  
 * |        |          |The IR_EN (GPIOx_IEN[n+16]) bit is used to enable the interrupt for each of the corresponding input Px.n pin. Set bit to 1 also enable the pin wake-up function.
 * |        |          |When setting the IR_EN (GPIOx_IEN[n+16]) bit to 1 :
 * |        |          |If the interrupt is level trigger (IMD (GPIOx_IMD[n]) bit is set to 1), the input Px.n pin will generate the interrupt while this pin state is at high level.
 * |        |          |If the interrupt is edge trigger (IMD (Px_IMD[n]) bit is set to 0), the input Px.n pin will generate the interrupt while this pin state changed from low to high.
 * |        |          |0 = Px.n level high or low to high interrupt Disabled.
 * |        |          |1 = Px.n level high or low to high interrupt Enabled.     
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 * @var GPIO_T::ISRC
 * Offset: 0x20/0x60/0xA0/0xE0/0x160  GPIO Port [A/B/C/D/F] Interrupt Source Flag
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[n]     |ISRCn     |GPIOx Pin[n] Interrupt Source Flag
 * |        |          |Read :
 * |        |          |0 = No interrupt at Px.n.
 * |        |          |1 = Px.n generates an interrupt.
 * |        |          |Write :
 * |        |          |0= No action.
 * |        |          |1= Clear the corresponding pending interrupt.
 * |        |          |Note:
 * |        |          |n = 10~15 for port A. Others are reserved.
 * |        |          |n = 0~10, 12~15 for port B. Others are reserved.
 * |        |          |n = 0~5, 8~13 for port C. Others are reserved.
 * |        |          |n = 0~5, 8~11 for port D. Others are reserved.
 * |        |          |n = 0~3 for port F. Others are reserved.
 */

    __IO uint32_t PMD;           /* Offset: 0x00/0x40/0x80/0xC0/0x140  GPIO Port [A/B/C/D/F] Pin I/O Mode Control    */
    __IO uint32_t OFFD;          /* Offset: 0x04/0x44/0x84/0xC4/0x144  GPIO Port [A/B/C/D/F] Pin Digital Input Path Disable Control */
    __IO uint32_t DOUT;          /* Offset: 0x08/0x48/0x88/0xC8/0x148  GPIO Port [A/B/C/D/F] Data Output Value       */
    __IO uint32_t DMASK;         /* Offset: 0x0C/0x4C/0x8C/0xCC/0x14C  GPIO Port [A/B/C/D/F] Data Output Write Mask  */
    __I  uint32_t PIN;           /* Offset: 0x10/0x50/0x90/0xD0/0x150  GPIO Port [A/B/C/D/F] Pin Value               */
    __IO uint32_t DBEN;          /* Offset: 0x14/0x54/0x94/0xD4/0x154  GPIO Port [A/B/C/D/F] De-bounce Enable        */
    __IO uint32_t IMD;           /* Offset: 0x18/0x58/0x98/0xD8/0x158  GPIO Port [A/B/C/D/F] Interrupt Mode Control  */
    __IO uint32_t IEN;           /* Offset: 0x1C/0x5C/0x9C/0xDC/0x15C  GPIO Port [A/B/C/D/F] Interrupt Enable        */
    __IO uint32_t ISRC;          /* Offset: 0x20/0x60/0xA0/0xE0/0x160  GPIO Port [A/B/C/D/F] Interrupt Source Flag   */

